Revit 2026 API

# PipingSystemDeleteHydraulicSeparation Method

---
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void DeleteHydraulicSeparation(
	Document document,
	ISet<ElementId> pipeElementIds
)
```
```vb
Public Shared Sub DeleteHydraulicSeparation (
	document As Document,
	pipeElementIds As ISet(Of ElementId)
)
```
```cpp
public:
static void DeleteHydraulicSeparation(
	Document^ document,
	ISet<ElementId^>^ pipeElementIds
)
```
```fsharp
static member DeleteHydraulicSeparation :
        document : Document *
        pipeElementIds : ISet<ElementId> -> unit
```

#### Parameters

document Document

pipeElementIds ISetElementId

#### Reference

PipingSystem Class

Autodesk.Revit.DB.Plumbing Namespace